# Brewfile - Managed Homebrew dependencies
# Install with: brew bundle --file=~/.config/brewfile/Brewfile

# ─── Taps ─────────────────────────────────────────────────────────────
tap "teamookla/speedtest"

# ─── CLI Tools ────────────────────────────────────────────────────────
brew "ast-grep"
brew "fnm"
brew "gh"
brew "git"
brew "htop"
brew "spaceship"
brew "speedtest"
brew "uv"
brew "wget"

# ─── Infrastructure / DevOps ──────────────────────────────────────────
brew "ansible"
brew "ansible-lint"
brew "awscli"
brew "duckdb"
brew "terraform"

# ─── Development ─────────────────────────────────────────────────────
cask "beekeeper-studio"
cask "claude-code"
cask "docker-desktop"
cask "ghostty"
cask "ngrok"
cask "zed"

# ─── Productivity ────────────────────────────────────────────────────
cask "google-chrome"
cask "granola"
cask "zoom"

# ─── Security ────────────────────────────────────────────────────────
cask "bitwarden"
cask "pareto-security"
