# Brewfile - Managed Homebrew dependencies
# Install with: brew bundle --file=~/.config/brewfile/Brewfile

# ─── Misc ─────────────────────────────────────────────────────────────
brew "htop"
brew "spaceship"
brew "tmux"

# ─── Infrastructure / DevOps ──────────────────────────────────────────
brew "awscli"
brew "duckdb"

# ─── Development ─────────────────────────────────────────────────────
brew "gh"
brew "git"
brew "uv"
cask "docker-desktop"
cask "ghostty"

# ─── Productivity ────────────────────────────────────────────────────
cask "google-chrome"
cask "granola"
cask "zoom"

# ─── Security ────────────────────────────────────────────────────────
cask "bitwarden"
cask "pareto-security"
